InformationRegisters/АК_ПеревозчикиПоКонтрагентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АК_ПеревозчикиПоКонтрагентам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АК_ПеревозчикиПоКонтрагентам/Ext/ManagerModule.bsl
//+++АК sole 2018.06.20 ИП-00018920.01
Функция ПолучитьСписокКонтрагентовДляФильтрации(Пользователь) Экспорт
	
	Перем Запрос;
	
	СписокДоступныхПеревозчиков = Новый СписокЗначений();
	
	Запрос = Новый Запрос();
	Запрос.Текст =
"ВЫБРАТЬ
|	АК_ПеревозчикиПоКонтрагентам.Перевозчик
|ИЗ
|	РегистрСведений.АК_ПеревозчикиПоКонтрагентам КАК АК_ПеревозчикиПоКонтрагентам
|ГДЕ АК_ПеревозчикиПоКонтрагентам.Пользователь = &Пользователь";
	
	Запрос.Параметры.Вставить("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		СписокДоступныхПеревозчиков.Добавить(Выборка.Перевозчик);
	КонецЦикла;
	
	Возврат СписокДоступныхПеревозчиков;
КонецФункции
